Public Attributes | List of all members
ACAPI::MEP::SystemBrowserCalculationCallbackInterface::ColumnRowEntry Struct Reference
MEP Element Manager
The signature of the entries in the result data. The row is decided by the system browser, so the entry is identified using the associated element id instead. More...
#include <MEPSystemBrowserCalculationCallbackInterface.hpp>
 Public Attributes
 GS::Guid  | elemId
Unique ID of the element.
 GS::UniString  | columnId
ID of the column. (should be the ID of one of the columns registered in RegisterCalculatedColumns)
 std::any  | value
The value of the column.Any value is accepted, but the value might not appear correctly in the browser if not implicitly convertible to a string.
Detailed Description
The signature of the entries in the result data. The row is decided by the system browser, so the entry is identified using the associated element id instead.